// Регуларни изрази

//1. Телефонски број

// ^\+389\s7[0-9]-[0-9]{3}-[0-9]{3}$
// Пример - +389 75 433 019

//2. Email адреса

// ^[a-zA-Z0-9._%+-]{1,64}@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$
// Пример - marko123@gmail.com
// + значи еден или повеќе од претходниот елемент

//3. Поштенски код

// ^[0-9]{4}$
// Пример - 1000

//4. Корисничко име

// ^[a-zA-Z0-9_]{5,15}$
// Пример - marko_123

//5.  Датум

// ^(0[1-9]|[12][0-9]|3[01])\/(0[1-9]|1[0-2])\/[0-9]{4}$

//^(0[1-9]|[12][0-9]|3[01]) е денот во датумот и ни
// кажува дека првата бројка може да почне
// со 0 и втората да и биде од 1 до 9
// или првата бројка да почне мора да почне со 1 или 2 и да заврши со било
// која од 0-9 или да почне со 3 и да заврши со 0 или 1 на крај.

// Пример - 12/03/2026

// 6. Лозинка 

// ^(?=.*[A-Z])(?=.*[0-9]).{8,}$ 

// Пример - helloWorld1

// ?=.* е lookahead односно ни дозволува условот да биде исполнет 
// негде понатака во стрингот, немора да е на почетокот тоа што се бара. 
// a .* значи дека може да има било кој карактер 0 или повеќе пати пред 
// да дојде до голема буква од A до Z.



// 7.Регистарски таблички

// ^[A-Z]{2}[0-9]{4}[A-Z]{2}$

// Пример - SK1234AB


// 8. IP Адреса

// ^(\d{1,3}\.){3}\d{1,3}$

// \d - Било која бројка од 0 до 9 {3} три пати максимум да се повтори со 
// \. измегју и истото е за последниот број мора да е 
// со 3 цифри само без точка на крај.

// Пример - 192.168.0.1

// 9. Време 

// ^([01]?[0-9]|2[0-3]):[0-5][0-9]$

// Првиот дел [01]?[0-9] е за бројки од 0 до 19
// ? ни кажува дека првиот број е опционален, или е 0 или 1
// Вториот дел е за 20,22,23


// Пример 14:22





